share/man/man4/man4.vax/fl.4
.\" Copyright (c) 1980, 1991 Regents of the University of California.
.\" All rights reserved.
.\"
.\" %sccs.include.redist.man%
.\"
.\"     @(#)fl.4	6.3 (Berkeley) 03/27/91
.\"
.Dd 
.Dt FL 4 vax
.Os BSD 4
.Sh NAME
.Nm fl
.Nd console floppy interface
.Sh DESCRIPTION
This is a simple interface to the
.Tn DEC
.Tn RX01
floppy disk unit, which is part of the console
.Tn LSI-11
subsystem for
.Tn VAX-11/780 Ns s .
Access is given to the entire
floppy consisting of 77 tracks of 26 sectors of 128 bytes.
.Pp
All I/O is raw; the seek addresses in raw transfers should be a multiple
of 128 bytes and a multiple of 128 bytes should be transferred,
as in other
.Dq raw
disk interfaces.
.Sh FILES
.Bl -tag -width /dev/floppy -compact
.It Pa /dev/floppy
.El
.Sh DIAGNOSTICS
None.
.Sh SEE ALSO
.Xr arff 8
.Sh HISTORY
The
.Nm
driver appeared in
.Bx 4.0 .
.Sh BUGS
Multiple console floppies are not supported.
.Pp
If a write is given with a count not a multiple of 128 bytes then
the trailing portion of the last sector will be zeroed.
